team = {
    1: (12, 1600),   # 1st - Redshift (사강대학교)
    2: (11, 894),    # 2nd - SCC_Sinchon Coding Champions (연세대학교)
    3: (11, 1327),   # 3rd - 월파출신 코지가 가르쳐고 있어요 (사강대학교)
    4: (10, 1311),   # 4th - 가으당 (연세대학교)
    5: (9, 1004),    # 5th - 1등하리웠습니다 (연세대학교)
    6: (9, 1178),    # 6th - 병공병 (홍익대학교)
    7: (9, 1357),    # 7th - 조성호 (사강대학교)
    8: (8, 837),     # 8th - 기령순이 그녀들 (사강대학교)
    9: (7, 1055),    # 9th - WooJeans (사강대학교)
    10: (6, 556),    # 10th - 홍하에프 (홍익대학교)
    11: (6, 773)     # 11th - 상금 도둑 (사강대학교)
}

n = int(input())

for rank, (team_num, time) in team.items():
    if rank == n:
        print(f"{team_num} {time}")